leonf08/SMBUS_PMBUS-Stack-STM32F407/SMBUS_PMBUS_Stack/Src/stm32_PMBUS_stack.c
/*
    dedicated command definitions for the extended command support
 */
st_command_t EXTENDED_READ_BYTE = { PMBC_PMBUS_COMMAND_EXT, PROCESS_CALL, 2, 1 };
st_command_t EXTENDED_READ_WORD = { PMBC_PMBUS_COMMAND_EXT, PROCESS_CALL, 2, 2 };
st_command_t EXTENDED_WRITE_BYTE = { PMBC_PMBUS_COMMAND_EXT, WRITE, 3, 0 };
st_command_t EXTENDED_WRITE_WORD = { PMBC_PMBUS_COMMAND_EXT, WRITE, 4, 0 };

/*
    dedicated command definition for the Zone read support
 */
st_command_t ZONE_READ_COMMAND = { 0, PROCESS_CALL, 2, 2 };

/* Private define ------------------------------------------------------------*/
#define NOT_USED(p) ((void)(p))

/**
  * @}
  */

/** @defgroup STM32_PMBUS_STACK_Functions
  * @{
  */

/**
  * @brief  PMBUS master group command transmit, direction is implicitly write.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  pCommand : description of the command to be transmitted, NULL for quick command
  * @param  address : device address
  * @param  last : last command in the group - STOP condition is transmitted if this flag is != 0
  * @retval SMBus stack return code
  */
HAL_StatusTypeDef STACK_PMBUS_HostCommandGroup(SMBUS_StackHandleTypeDef *pStackContext, st_command_t* pCommand, uint16_t address, uint8_t last)
{
  HAL_StatusTypeDef     result = STACK_ERROR;
  uint16_t              size;
  uint32_t              xFerOptions = SMBUS_FIRST_FRAME;

  /*
    First check status of the SMBUS - no transaction ongoing
  */
  if (( ((pStackContext->StateMachine) & SMBUS_SMS_ACTIVE_MASK) == 0 ) && ( ( pCommand->cmnd_query & WRITE ) == WRITE ) )
  {
    if ( pCommand == NULL )
    {
      /*
        quick command case
        */
      size = 0;
    }
    else
    {
      /*
      the command must support write mode, otherwise is unusable for grouping
      */

      pStackContext->OpMode = pCommand->cmnd_query & BLOCK_WRITE;

      /*
        Remembering the address and command code for case of further processing of non-trivial command
      */
      pStackContext->SlaveAddress = address;
      pStackContext->CurrentCommand = pCommand;

      /*
      First byte, the command code is transmitted
      */
      pStackContext->Buffer[0] = pCommand->cmnd_code;

      if ( pCommand->cmnd_query & BLOCK )
      {
        /*
            Block write with data size prepared in the buffer.
          */
        size = 2 + pStackContext->Buffer[1];            /* 1 cmd code + 1 count + data size */
      }
      else
      {
        /*
        fixed size write
        */
        size = pCommand->cmnd_master_Tx_size;
      }

      xFerOptions |= ( pStackContext->StateMachine & SMBUS_SMS_PEC_ACTIVE );
      if (pStackContext->StateMachine & SMBUS_SMS_PEC_ACTIVE )
      {
        size += 1;
      }
    }

    /*
      finishing transmission
     */
    if ( last != 0 )
    {
      xFerOptions |= SMBUS_LAST_FRAME;
    }

    /*
      Initiating a transmission
      */
    pStackContext->StateMachine |= SMBUS_SMS_TRANSMIT;
    pStackContext->StateMachine &= ~SMBUS_SMS_READY;

    /*
      Sending the data and logging the result
      */
    result = HAL_SMBUS_Master_Sequential_Transmit_IT( pStackContext->Device, address, pStackContext->Buffer, size, xFerOptions );
    if (result != HAL_OK )
    {
      pStackContext->StateMachine |= SMBUS_SMS_ERROR;
    }
  }
  return result;
}


/**
  * @brief  a version of the default SMBUS implementation with support for
  *       PMBus extended command
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @retval None
  */
void STACK_SMBUS_LocateCommand( SMBUS_StackHandleTypeDef* pStackContext )
{
  uint8_t       commandCode = pStackContext->Buffer[0];
#ifdef DENSE_CMD_TBL
  uint32_t      current, low, top;
#endif

#ifdef ARP
  if ( pStackContext->StateMachine & SMBUS_SMS_ARP_AM )
  {
    STACK_SMBUS_LocateCommandARP( pStackContext, commandCode );
  }
  else
#endif /* ARP treatment */

    if (commandCode == PMBC_PMBUS_COMMAND_EXT)
    {
      /*
        May not be exactly read byte, but the stack cannot know for sure
       */
      pStackContext->CurrentCommand = &EXTENDED_READ_BYTE;
    }
    else
    {
      /*
        Code searching for command based on command code
        */
#ifdef DENSE_CMD_TBL

      /*
        initializing the command code search - the table must have all commands sorted, but there may be gaps
       */
      low = 0;
      top = pStackContext->CMD_tableSize - 1;
      pStackContext->CurrentCommand = NULL;

      while ( top >= low )
      {
        /*
          Pick interval half
         */
        current = ( low + top ) >> 1 ;
        if (pStackContext->CMD_table[current].cmnd_code == commandCode)
        {
          /*
            we have found our command
           */
          pStackContext->CurrentCommand = &(pStackContext->CMD_table[current]);
          return;
        }
        else if (pStackContext->CMD_table[current].cmnd_code < commandCode)
        {
          /*
            Look at upper half
          */
          low = current + 1;
        }
        else
        {
          top = current - 1;
        }
      }
#else
      /*
      Simple command table - command code equals the table index
      */
      pStackContext->CurrentCommand = &(pStackContext->CMD_table[commandCode]);

      /* a sanity check */
      if ( pStackContext->CurrentCommand->cmnd_code != commandCode )
      {
        pStackContext->CurrentCommand = NULL;
      }
#endif /* DENSE_CMD_TBL */
    }
}


#ifdef  PMBUS13 /* Zone commands were introduced in v1.3 */

/**
  * @brief  PMBUS zone write command transmit, direction is implicitly write.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  pCommand : description of the command to be transmitted, NULL for quick command
  * @param  zone : the zone context in which the command executes
  * @retval SMBus stack return code
  */
HAL_StatusTypeDef STACK_PMBUS_MasterZoneWrite(SMBUS_StackHandleTypeDef *pStackContext, st_command_t* pCommand)
{
  HAL_StatusTypeDef     result = STACK_ERROR;
  uint16_t              size;
  uint32_t              xFerOptions = SMBUS_FIRST_FRAME;

