leonf08/SMBUS_PMBUS-Stack-STM32F407/SMBUS_PMBUS_Stack/Src/stm32_PMBUS_stack.c
  /*
    First check status of the SMBUS - no transaction ongoing, and that the command is write direction
  */
  if (( ((pStackContext->StateMachine) & SMBUS_SMS_ACTIVE_MASK) == 0 ) && ( ( pCommand->cmnd_query & WRITE ) == WRITE ) )
  {    
    if ( pCommand == NULL )
    {
    /*
      quick command case
      */
      size = 0;
    }
    else
    {
      /*
      the command must support write mode, otherwise is unusable for zone
      */
      pStackContext->OpMode = pCommand->cmnd_query & BLOCK_WRITE;

      /*
        Remembering the address and command code for case of further processing of non-trivial command
      */
      pStackContext->SlaveAddress = SMBUS_ADDR_ZONE_WRITE;
      pStackContext->CurrentCommand = pCommand;

      /*
      First byte, the command code is transmitted
      */
      pStackContext->Buffer[0] = pCommand->cmnd_code;

      if ( pCommand->cmnd_query & BLOCK )
      {
      /*
          Block write with data size prepared in the buffer.
        */
        size = 2 + pStackContext->Buffer[1];            /* 1 cmd code + 1 count + data size */
      }
      else
      {
        /*
        fixed size write
        */
        size = pCommand->cmnd_master_Tx_size;
      }

      xFerOptions |= ( pStackContext->StateMachine & SMBUS_SMS_PEC_ACTIVE );
      if (pStackContext->StateMachine & SMBUS_SMS_PEC_ACTIVE )
      {
        size += 1;
      }
    }
    
    /*
      finishing transmission
     */
    xFerOptions |= SMBUS_LAST_FRAME;

    /*
      Initiating a transmission
      */
    pStackContext->StateMachine |= SMBUS_SMS_TRANSMIT;
    pStackContext->StateMachine &= ~SMBUS_SMS_READY;

    /*
      Sending the data and logging the result
      */
    result = HAL_SMBUS_Master_Sequential_Transmit_IT( pStackContext->Device, SMBUS_ADDR_ZONE_WRITE, pStackContext->Buffer, size, xFerOptions );
    if (result != HAL_OK )
    {
      pStackContext->StateMachine |= SMBUS_SMS_ERROR;
    }
  }
  return result;
}

/**
  * @brief  PMBUS zone config command transmit, direction is implicitly write.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  address : address of the device to be configured
  * @param  zone : the zone context to be configured
  * @retval SMBus stack return code
  */
HAL_StatusTypeDef STACK_PMBUS_MasterZoneConfig(SMBUS_StackHandleTypeDef *pStackContext, uint16_t address, SMBUS_ZoneStateTypeDef* zone)
{ 
  pStackContext->Buffer[1] = zone->writeZone;
  pStackContext->Buffer[2] = zone->readZone;
  return STACK_SMBUS_HostCommand( pStackContext, (st_command_t*)&PMBUS_COMMANDS_TAB[PMBC_ZONE_CONFIG], address, WRITE ); 
}

/**
  * @brief  PMBUS zone active command transmit, direction is implicitly write.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  zone : the zones to be activated
  * @retval SMBus stack return code
  */
HAL_StatusTypeDef STACK_PMBUS_MasterZoneActive(SMBUS_StackHandleTypeDef *pStackContext, SMBUS_ZoneStateTypeDef* zone)
{ 
  pStackContext->Buffer[1] = zone->activeWriteZone;
  pStackContext->Buffer[2] = zone->activeReadZone;
  return STACK_SMBUS_HostCommand( pStackContext, (st_command_t*)&PMBUS_COMMANDS_TAB[PMBC_ZONE_ACTIVE], SMBUS_ADDR_ZONE_WRITE, WRITE ); 
}

/**
  * @brief  PMBUS zone read command initiation, simple implementation limited to status retrieve from single page devices.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  ccode : command control code
  * @param  mask : status mask
  * @retval SMBus stack return code
  */
HAL_StatusTypeDef STACK_PMBUS_MasterReadZoneStatus(SMBUS_StackHandleTypeDef *pStackContext, uint8_t ccode, uint8_t mask)
{ 
  HAL_StatusTypeDef     result = STACK_ERROR;

  /*
    First check status of the SMBUS - no transaction ongoing
   */
  if (((pStackContext->StateMachine) & SMBUS_SMS_ACTIVE_MASK) == 0 ) 
  {    
    /*
      Remembering the address and command code for case of further processing of non-trivial command
    */
    pStackContext->SlaveAddress = SMBUS_ADDR_ZONE_READ;
    pStackContext->CurrentCommand = NULL;

    /*
      First byte, the command code is transmitted
    */
    pStackContext->Buffer[0] = ccode;
    pStackContext->Buffer[1] = mask;

    /*
      Initiating a transmission
     */
    pStackContext->StateMachine |= SMBUS_SMS_TRANSMIT;
    pStackContext->StateMachine &= ~SMBUS_SMS_READY;

    /*
      Sending the data and logging the result
     */
    result = HAL_SMBUS_Master_Sequential_Transmit_IT( pStackContext->Device, SMBUS_ADDR_ZONE_READ, pStackContext->Buffer, 2, SMBUS_FIRST_FRAME );
    if (result != HAL_OK )
    {
      pStackContext->StateMachine |= SMBUS_SMS_ERROR;
    }
  }
  return result;
}

/**
  * @brief  Implementation of Zone read continuation - Master side.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the context information for the specified SMBUS stack.
  * @retval HAL_StatusTypeDef response code. STACK_OK if success, any other value means problem
  */
HAL_StatusTypeDef STACK_PMBUS_MasterZoneReadStatusCont(SMBUS_StackHandleTypeDef *pStackContext)
{
  HAL_StatusTypeDef     result = STACK_ERROR;
  
  result = HAL_SMBUS_Master_Sequential_Receive_IT( pStackContext->Device, SMBUS_ADDR_ZONE_READ, pStackContext->Buffer, 2, SMBUS_NO_OPTION_FRAME);
  if (result != HAL_OK )
  {
    pStackContext->StateMachine |= SMBUS_SMS_ERROR;
  }
  return result;
}

/**
  * @brief  Callback function notifying slave about Zone read.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the context information for the specified SMBUS stack.
  * @param  number : Indicates if this command header, or read request
  * @retval HAL_StatusTypeDef response code. STACK_OK if success, any other value means problem
  */
__weak HAL_StatusTypeDef STACK_PMBUS_ZoneReadCallback( SMBUS_StackHandleTypeDef* pStackContext, uint8_t number )
{
  uint8_t ccc, mask;
  
  if ( number == 1 )
  {
    /* Command just received, here the device should read COMMAND CONTROL CODE and Mask*/
    ccc = pStackContext->Buffer[0];
    mask =  pStackContext->Buffer[1];    
    NOT_USED(ccc);
    NOT_USED(mask);
  }
  else
  {
    /* Read phase of the Zone read - arbitarry number returned by example*/
    pStackContext->Buffer[1] = 0xa5;
    pStackContext->Buffer[2] = pStackContext->OwnAddress;
  }
 
  /*
    Returning zero means no problem with execution, if reply is expected, then it must be placed to the IO buffer
   */
  return STACK_OK;
}
#endif  /* PMBUS13 */

/**
  * @}
  */

/**
  * @}
  */


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
